Hello @AlexMili, I have tested the following code and it works as expected. Is it possible you are not indicating the right region when trying to list queues? It might be because it is a per-region service and not a wide one. If I am not mistaken, by default `awslocal` uses `us-east-1`.

Run localstack (tested with `latest`, `0.13` and `0.12`):
```
docker run -ti --rm --name localstack -p 4566:4566 localstack/localstack:latest
```

main.tf:
```hcl
provider "aws" {
  region = "eu-west-3"

  access_key = "test"
  secret_key = "test"

  s3_force_path_style         = true
  skip_credentials_validation = true
  skip_metadata_api_check     = true
  skip_requesting_account_id  = true

  endpoints {
    sqs            = "http://localhost:4566"
  }
}

resource "aws_sqs_queue" "test_sqs" {
  name = "test-sqs"
  tags = {}
}
```

Terraform apply output:
```
$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_sqs_queue.test_sqs will be created
  + resource "aws_sqs_queue" "test_sqs" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "test-sqs"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_sqs_queue.test_sqs: Creating...
aws_sqs_queue.test_sqs: Creation complete after 1s [id=http://localhost:4566/000000000000/test-sqs]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

List queues (check the region I am using):
```
$ awslocal sqs list-queues
$ awslocal sqs list-queues --region=eu-west-3
{
    "QueueUrls": [
        "http://localhost:4566/000000000000/test-sqs"
    ]
}

$ awslocal --region=eu-west-3 sqs send-message --queue-url http://localhost:4566/00000000000/test-sqs --message-body test
{
    "MD5OfMessageBody": "098f6bcd4621d373cade4e832627b4f6",
    "MessageId": "8e1e5412-eb13-a313-53ee-0e297df06d6a"
}
```

Let me know if it worked for you as well. Cheers!